
# __________________________________________________________________

# """Список с нужными расширениями"""
# list_of_extensions = ['*.png','*.jpg']
#
# """Здесь храним пути к файлам ,прошедшими отбор фото"""
# z = []
#
# """Добавляем путь до папки где хранятся фото для обработки
# В метод glob() передаем параметры с нужным расширением"""
# for ext in list_of_extensions:
#     z.extend(Path(........).glob(ext))
# # _____________________________________________________________________
#
# def pdf_to_mp3(file_path = 'test.pdf',language = 'en'):
#     if Path(file_path).is_file() and Path(file_path).suffix == '.pdf':
#         pass
#
# """is_file() проверяет действительно по переданному пути file_path
# существует  файл test.pdf"""
# """Далее через suffix проверяем действительно ли файл test.pdf
# имеет нужное нам расширение т.е. .pdf"""
# ______________________________________________________________________