

# (a := 6, 9)
# (a, b := 16, 19)
# print(f"{a=} {b=}") # a=6 b=16

"""Охуенная программка """
print('#'*50)
w = []

while  x:= input("Введите погремуху Влада в студенчестве :") != "хэлс":
    w.append(x)

print()
print('*'*40)
print(f"Вот такие ты набрал неверные варианты:\n{w}")

# ##################################################
# Введите погремуху Влада в студенчестве :барчо
# Введите погремуху Влада в студенчестве :хмурый
# Введите погремуху Влада в студенчестве :струк
# Введите погремуху Влада в студенчестве :сутулый
# Введите погремуху Влада в студенчестве :влад
# Введите погремуху Влада в студенчестве :остряк
# Введите погремуху Влада в студенчестве :хэлс
#
# ****************************************
# Вот такие ты набрал неверные варианты:
# ['барчо', 'хмурый', 'струк', 'сутулый', 'влад', 'остряк']

