
qwer = ['num = {}'.format(i) for i in range(1,10,2)]
for s in qwer: print(s)
# num = 1
# num = 3
# num = 5
# num = 7
# num = 9

kox = ["Значение {1} ... Индекс {0}".format(v,k) for v,k in enumerate([1,2,3,4,5,6,7,8])]
for s in kox: print(s)
# Значение 1 ... Индекс 0
# Значение 2 ... Индекс 1
# Значение 3 ... Индекс 2
# Значение 4 ... Индекс 3
# Значение 5 ... Индекс 4
# Значение 6 ... Индекс 5
# Значение 7 ... Индекс 6
# Значение 8 ... Индекс 7

asd = ["Значение {1} ... Индекс {0}".format(v,k) for v,k in enumerate(list(range(5)),1)]
for s in asd: print(s)
# Значение 0 ... Индекс 1
# Значение 1 ... Индекс 2
# Значение 2 ... Индекс 3
# Значение 3 ... Индекс 4
# Значение 4 ... Индекс 5
